/*▄────────────────────▄
  █                    █
  █  Загрузка модулей  █
  █                    █
  ▀────────────────────▀*/
const EventEmitter = require('events');

/*▄─────────────────────────▄
  █                         █
  █  Создает движок команд  █
  █                         █
  ▀─────────────────────────▀*/
module.exports = class CommandEngine extends EventEmitter {
/*┌─────────────┐
  │ Конструктор │
  └─────────────┘*/
    constructor(engine) {
    // Вызываем конструктор родителя
        super();
        
    // Инициализируем движок
        engine(this);
        
    // Инициализируем список логических единиц
        engine.logic(
            'binder', // Логика привязки списка команд (Protocol → Channel)
        );
        
    // Инициализируем списки команд
        engine.commands(
               'core', // Список внутренних команд протокола
            'notices', // Список команд уведомлений
            'scanner', // Список команд приемника
             'sender', // Список команд передатчика
        );
    }
    
/*┌────────────────────────────────────────────────┐
  │ Привязывает список команд (Protocol → Channel) │
  └────────────────────────────────────────────────┘*/
    bindCommands = (commandAdapters) => {
        this.binder.bindCommands(commandAdapters);
    }
    
/*┌──────────────────────────────────┐
  │ Сообщает о готовности соединения │
  └──────────────────────────────────┘*/
    ready = () => {
        this.commands.core.ready();
    }
    
/*┌─────────────────────────────┐
  │ Сообщает о получении пакета │
  └─────────────────────────────┘*/
    data = (packet, packetBuffer) => {
        this.commands.core.data(packet, packetBuffer);
    }
    
/*┌───────────────────────────────────────┐
  │ Сообщает о получении нового сообщения │
  └───────────────────────────────────────┘*/
    message = (message) => {
        this.commands.core.message(message);
    }
    
/*┌───────────────────────────────┐
  │ Сообщает о доставке сообщения │
  └───────────────────────────────┘*/
    delivered = (message) => {
        this.commands.core.delivered(message);
    }
    
/*┌────────────────────────────────────────────────┐
  │ Сообщает о получении информационного сообщения │
  └────────────────────────────────────────────────┘*/
    info = (reason) => {
        this.commands.notices.info(reason);
    }
    
/*┌─────────────────────────────────────┐
  │ Сообщает о получении предупреждения │
  └─────────────────────────────────────┘*/
    warn = (reason) => {
        this.commands.notices.warn(reason);
    }
    
/*┌──────────────────────────────────────────┐
  │ Сообщает о получении сообщения об ошибке │
  └──────────────────────────────────────────┘*/
    error = (reason) => {
        this.commands.notices.error(reason);
    }
    
/*┌───────────────────────────────────────────────┐
  │ Обновляет буфер пакета для следующей отправки │
  └───────────────────────────────────────────────┘*/
    updatePacketBuffer = (packetBuffer) => {
        this.commands.sender.updatePacketBuffer(packetBuffer);
    }
};
