/*▄──────────────────────────────────────────────────────────────▄
  █                                                              █
  █  Создает логику привязки списка команд (Protocol → Channel)  █
  █                                                              █
  ▀──────────────────────────────────────────────────────────────▀*/
module.exports = class CommandsCommand {
/*┌─────────────┐
  │ Конструктор │
  └─────────────┘*/
    constructor(logic) {
    // Инициализируем логическую единицу
        logic(this);
    }
    
/*┌────────────────────────────────────────────────┐
  │ Привязывает список команд (Protocol → Channel) │
  └────────────────────────────────────────────────┘*/
    bindCommands = (commandAdapters) => {
    // Проходим по списку адаптеров
        for (const [command, handler] of Object.entries(commandAdapters)) {
        // Привязываем команду
            this.engine.on(command, handler);
        }
    }
};
