/*────────────────────────────────────────────────────────────────────────────────────────────────*/

Object.defineProperties(global,{__:{set:v=>process.exit(_=v)},_:{set:console.log}});
Object.defineProperty(global, '$', {value:{}});

/*────────────────────────────────────────────────────────────────────────────────────────────────*/

console.clear();

/*────────────────────────────────────────────────────────────────────────────────────────────────*/

const PACKET = new class packetStructure {
/*┌───────────────────────────────┐
  │ Общий размер для всех пакетов │
  └───────────────────────────────┘*/
    SIZE = 1508
    
/*┌─────────────────────┐
  │ Пакет инициализации │
  └─────────────────────┘*/
    INIT = new class {
        /*  Поле     Смещение    Размер    */
        PACKETID = { OFFSET:  0, SIZE: 32 } // ID-пакета
            HASH = { OFFSET: 32, SIZE: 64 } // Хэш-сумма
    }
    
/*┌─────────────────────┐
  │ Пакет синхронизации │
  └─────────────────────┘*/
    SYNC = new class {
        /*  Поле     Смещение    Размер    */
        PACKETID = { OFFSET:  0, SIZE: 32 } // ID-пакета
            HASH = { OFFSET: 32, SIZE: 64 } // Хэш-сумма
    }
    
/*┌────────────┐
  │ Пинг-пакет │
  └────────────┘*/
    PING = new class {
        /*  Поле     Смещение    Размер    */
        PACKETID = { OFFSET:  0, SIZE: 17 } // ID-пакета
            HASH = { OFFSET: 17, SIZE: 17 } // Хэш-сумма
    }
    
/*┌───────────────────────┐
  │ Пакет передачи данных │
  └───────────────────────┘*/
    DATA = new class {
        /*  Поле     Смещение    Размер    */
        PACKETID = { OFFSET:  0, SIZE:   17 } // ID-пакета
            HASH = { OFFSET: 17, SIZE:   17 } // Хэш-сумма
          LENGTH = { OFFSET: 34, SIZE:    2 } // Длина фрагмента
        FRAGMENT = { OFFSET: 36, SIZE: 1472 } // Фрагмент
    }
};

/*────────────────────────────────────────────────────────────────────────────────────────────────*/

const FIELDS = new class {
/*┌─────────────────────────────────────┐
  │ Добавляет структуру в спискок полей │
  └─────────────────────────────────────┘*/
    constructor() {
    // Проходим по спискам полей пакетов
        for (const list of Object.values(this)) {
            for (const [type, fields] of Object.entries(list)) {
                list[type] = fields.map(field => [field, PACKET[type][field]]);
            }
        }
    }
    
/*┌─────────────────────────────────┐
  │ Списки полей полученных пакетов │
  └─────────────────────────────────┘*/
    SCAN_FIELDS = {
    // Пакет инициализации
        INIT: [
            'HASH', // Хэш-сумма
        ],
        
    // Пакет синхронизации
        SYNC: [
            'HASH', // Хэш-сумма
        ],
        
    // Пинг-пакет
        PING: [
            'HASH', // Хэш-сумма
        ],
        
    // Пакет передачи данных
        DATA: [
                'HASH', // Хэш-сумма
              'LENGTH', // Длина фрагмента
            'FRAGMENT', // Фрагмент
        ],
    }
    
/*┌───────────────────────────────┐
  │ Списки полей пакетов отправки │
  └───────────────────────────────┘*/
    SEND_FIELDS = {
    // Пакет инициализации
        INIT: [
            'PACKETID', // ID-пакета
                'HASH', // Хэш-сумма
        ],
        
    // Пакет синхронизации
        SYNC: [
            'PACKETID', // ID-пакета
                'HASH', // Хэш-сумма
        ],
        
    // Пинг-пакет
        PING: [
            'PACKETID', // ID-пакета
                'HASH', // Хэш-сумма
        ],
        
    // Пакет передачи данных
        DATA: [
            'PACKETID', // ID-пакета
                'HASH', // Хэш-сумма
              'LENGTH', // Длина фрагмента
            'FRAGMENT', // Фрагмент
        ],
    }
};
