/*▄────────────────────────────────────▄
  █                                    █
  █  Создает логику событий протокола  █
  █                                    █
  ▀────────────────────────────────────▀*/
module.exports = class CoreEvent {
/*┌─────────────┐
  │ Конструктор │
  └─────────────┘*/
    constructor(logic) {
    // Инициализируем логическую единицу
        logic(this);
    }
    
/*┌──────────────────────────────────┐
  │ Сообщает о готовности соединения │
  └──────────────────────────────────┘*/
    ready = () => {
        this.protocol.emit('ready');
    }
    
/*┌─────────────────────────────┐
  │ Сообщает о получении пакета │
  └─────────────────────────────┘*/
    data = (packet, packetBuffer) => {
        this.protocol.emit('data', packet, packetBuffer);
    }
    
/*┌───────────────────────────────────────┐
  │ Сообщает о получении нового сообщения │
  └───────────────────────────────────────┘*/
    message = (message) => {
        this.protocol.emit('message', message);
    }
    
/*┌───────────────────────────────┐
  │ Сообщает о доставке сообщения │
  └───────────────────────────────┘*/
    delivered = (message) => {
        this.protocol.emit('delivered', message);
    }
};
