/*▄───────────────────────────────────────────▄
  █                                           █
  █  Создает логику события получения пакета  █
  █                                           █
  ▀───────────────────────────────────────────▀*/
module.exports = class DataEvent {
/*┌─────────────┐
  │ Конструктор │
  └─────────────┘*/
    constructor(logic) {
    // Инициализируем логическую единицу
        logic(this);
    }
    
/*┌─────────────────────────────┐
  │ Сообщает о получении пакета │
  └─────────────────────────────┘*/
    emit = (packet, packetBuffer) => {
        this.protocol.emit('data', packet, packetBuffer);
    }
};
