/*▄─────────────────────────────────────────────▄
  █                                             █
  █  Создает логику события доставки сообщения  █
  █                                             █
  ▀─────────────────────────────────────────────▀*/
module.exports = class DeliveredEvent {
/*┌─────────────┐
  │ Конструктор │
  └─────────────┘*/
    constructor(logic) {
    // Инициализируем логическую единицу
        logic(this);
    }
    
/*┌───────────────────────────────┐
  │ Сообщает о доставке сообщения │
  └───────────────────────────────┘*/
    emit = (message) => {
        this.protocol.emit('delivered', message);
    }
};
