/*▄─────────────────────────────────────────────────────▄
  █                                                     █
  █  Создает логику события получения нового сообщения  █
  █                                                     █
  ▀─────────────────────────────────────────────────────▀*/
module.exports = class MessageEvent {
/*┌─────────────┐
  │ Конструктор │
  └─────────────┘*/
    constructor(logic) {
    // Инициализируем логическую единицу
        logic(this);
    }
    
/*┌───────────────────────────────────────┐
  │ Сообщает о получении нового сообщения │
  └───────────────────────────────────────┘*/
    emit = (message) => {
        this.protocol.emit('message', message);
    }
};
