/*▄────────────────────────────────────────────────▄
  █                                                █
  █  Создает логику события готовности соединения  █
  █                                                █
  ▀────────────────────────────────────────────────▀*/
module.exports = class ReadyEvent {
/*┌─────────────┐
  │ Конструктор │
  └─────────────┘*/
    constructor(logic) {
    // Инициализируем логическую единицу
        logic(this);
    }
    
/*┌──────────────────────────────────┐
  │ Сообщает о готовности соединения │
  └──────────────────────────────────┘*/
    emit = () => {
        this.protocol.emit('ready');
    }
};
