/*▄────────────────────────────────────▄
  █                                    █
  █  Создает логику событий приемника  █
  █                                    █
  ▀────────────────────────────────────▀*/
module.exports = class ScannerEvent {
/*┌─────────────┐
  │ Конструктор │
  └─────────────┘*/
    constructor(logic) {
    // Инициализируем логическую единицу
        logic(this);
    }
    
/*┌─────────────────────────────┐
  │ Сообщает о получении пакета │
  └─────────────────────────────┘*/
    data = (packetBuffer) => {
        this.protocol.io.onPacket(packetBuffer);
    }
    
/*┌──────────────────────────────┐
  │ Сообщает о запуске приемника │
  └──────────────────────────────┘*/
    start = () => {
        this.protocol.emit('scanner:start');
    }
    
/*┌─────────────────────────────────┐
  │ Сообщает об остановке приемника │
  └─────────────────────────────────┘*/
    stop = () => {
        this.protocol.emit('scanner:stop');
    }
    
/*┌──────────────────────────────────┐
  │ Сообщает о перезапуске приемника │
  └──────────────────────────────────┘*/
    restart = (reason) => {
        this.protocol.emit('scanner:restart', reason);
    }
    
/*┌──────────────────────────────┐
  │ Сообщает об ошибке приемника │
  └──────────────────────────────┘*/
    error = (error) => {
        this.protocol.emit('scanner:error', error);
    }
    
/*┌────────────────────────────────────────────┐
  │ Сообщает об аварийном завершении приемника │
  └────────────────────────────────────────────┘*/
    exit = (code) => {
        this.protocol.emit('scanner:exit', code);
    }
    
/*┌────────────────────────────────────────────────────────────────────────────┐
  │ Сообщает о истечении времени получения пакета (приемник будет перезапущен) │
  └────────────────────────────────────────────────────────────────────────────┘*/
    timeout = () => {
        this.protocol.emit('scanner:timeout');
    }
};
