/*▄──────────────────────────────────────▄
  █                                      █
  █  Создает логику событий передатчика  █
  █                                      █
  ▀──────────────────────────────────────▀*/
module.exports = class SenderEvent {
/*┌─────────────┐
  │ Конструктор │
  └─────────────┘*/
    constructor(logic) {
    // Инициализируем логическую единицу
        logic(this);
    }
    
/*┌────────────────────────────────┐
  │ Сообщает о запуске передатчика │
  └────────────────────────────────┘*/
    start = () => {
        this.protocol.emit('sender:start');
    }
    
/*┌───────────────────────────────────┐
  │ Сообщает об остановке передатчика │
  └───────────────────────────────────┘*/
    stop = () => {
        this.protocol.emit('sender:stop');
    }
    
/*┌────────────────────────────────────┐
  │ Сообщает о перезапуске передатчика │
  └────────────────────────────────────┘*/
    restart = (reason) => {
        this.protocol.emit('sender:restart', reason);
    }
    
/*┌────────────────────────────────┐
  │ Сообщает об ошибке передатчика │
  └────────────────────────────────┘*/
    error = (error) => {
        this.protocol.emit('sender:error', error);
    }
    
/*┌──────────────────────────────────────────────┐
  │ Сообщает об аварийном завершении передатчика │
  └──────────────────────────────────────────────┘*/
    exit = (code) => {
        this.protocol.emit('sender:exit', code);
    }
    
/*┌─────────────────────────────────────────────────────────────────────────────┐
  │ Сообщает о истечении времени отправки пакета (передатчик будет перезапущен) │
  └─────────────────────────────────────────────────────────────────────────────┘*/
    timeout = () => {
        this.protocol.emit('sender:timeout');
    }
};
