/*▄────────────────────▄
  █                    █
  █  Загрузка модулей  █
  █                    █
  ▀────────────────────▀*/
const { Scanner } = require('l2raw'); // Работа с RAW-пакетами на уровне L2

/*▄────────────────────────────────────▄
  █                                    █
  █  Создает роль адаптации приемника  █
  █                                    █
  ▀────────────────────────────────────▀*/
module.exports = class ScannerL2raw {
/*┌────────────────────┐
  │ Опции по умолчанию │
  └────────────────────┘*/
    defaultOptions = {
    // Приемник
        scanner: {
            iface:     'eth0', // Имя сетевого интерфейса
            delay:        100, // Задержка между пакетами   = 0.1 сек
            delayError: 60000, // Задержка после ошибки     =  60 сек
            timeout:   600000, // Время на получение пакета =  10 мин
        },
    }
    
/*┌─────────────┐
  │ Конструктор │
  └─────────────┘*/
    constructor(role) {
    // Инициализируем роль
        role(this);
    }
    
/*┌─────────────────────────────────────────────────────────┐
  │ Список адаптеров для приема команд (Protocol → Channel) │
  └─────────────────────────────────────────────────────────┘*/
    commandAdapters = (scanner, commands) => ({
    })
    
/*┌─────────────────────────────────────────────────────────────┐
  │ Список адаптеров для передачи сигналов (Channel → Protocol) │
  └─────────────────────────────────────────────────────────────┘*/
    signalAdapters = (scanner, {
           DATA, // Сигнал получения пакетов
          START, // Сигнал запуска приемника
           STOP, // Сигнал остановки приемника
        RESTART, // Сигнал перезапуска приемника
          ERROR, // Сигнал ошибок приемника
           EXIT, // Сигнал аварийного завершения приемника
        TIMEOUT, // Сигнал таймаута приемника
    }) => ({
           [DATA]: (handler) => scanner.on('data', handler),
          [START]: (handler) => scanner.on('start', handler),
           [STOP]: (handler) => scanner.on('stop', handler),
        [RESTART]: (handler) => scanner.on('restart', handler),
          [ERROR]: (handler) => scanner.on('error', handler),
           [EXIT]: (handler) => scanner.on('exit', handler),
        [TIMEOUT]: (handler) => scanner.on('timeout', handler),
    })
    
/*┌─────────────────────────┐
  │ Инициализирует приемник │
  └─────────────────────────┘*/
    initScanner = (options) => {
    // Инициализируем приемник
        const scanner = new Scanner(options);
        
    // Возвращаем приемник
        return scanner;
    }
};
