/*▄─────────────────────────────────────────────────▄
  █                                                 █
  █  Создает логику инициализации выбранного языка  █
  █                                                 █
  ▀─────────────────────────────────────────────────▀*/
module.exports = class DirectorLang {
/*┌─────────────┐
  │ Конструктор │
  └─────────────┘*/
    constructor(logic) {
    // Инициализируем логическую единицу
        logic(this);
    }
    
/*┌───────────────────────────────┐
  │ Инициализирует выбранный язык │
  └───────────────────────────────┘*/
    initLang = () => {
    // Активируем выбранный язык
        this.engine.activator.activateLang();
    }
};
