/*▄───────────────────────────────────▄
  █                                   █
  █  Создает движок обработки потока  █
  █                                   █
  ▀───────────────────────────────────▀*/
module.exports = class FlowEngine {
/*┌─────────────┐
  │ Конструктор │
  └─────────────┘*/
    constructor(engine) {
    // Инициализируем движок
        engine(this);
        
    // Инициализируем список логических единиц
        engine.logic(
            'incoming', // Логика обработки входящих пакетов
            'outgoing', // Логика обработки исходящих пакетов
        );
    }
    
/*┌───────────────────────────────┐
  │ Обрабатывает полученный пакет │
  └───────────────────────────────┘*/
    handlePacket = (packet, category, packetBuffer) => {
        this.incoming.handlePacket(packet, category, packetBuffer);
    }
    
/*┌─────────────────────────────────────┐
  │ Инициализирует начально авторизации │
  └─────────────────────────────────────┘*/
    initAuth = () => {
        this.outgoing.initAuth();
    }
};
