/*▄──────────────────────────────────────────────────────────────────▄
  █                                                                  █
  █  Протокол передачи сообщений между двумя сторонами на уровне L2  █
  █                                                                  █
  ▀──────────────────────────────────────────────────────────────────▀*/
module.exports = new class {
/*┌────────────────────────┐
  │ Создает новый протокол │
  └────────────────────────┘*/
    Protocol = require('./lib/protocol.js')
};
