/*▄────────────────────▄
  █                    █
  █  Загрузка модулей  █
  █                    █
  ▀────────────────────▀*/
const PACKET = require('../../constants/packet-structure'); // Структура полей пакетов

/*┌───────────────────────────────────┐
  │ Извлекаем структуру полей пакетов │
  └───────────────────────────────────┘*/
const {
// Финальный буфер
    HASH, // Хэш-целостности
} = PACKET;

/*▄──────────────────────────────▄
  █                              █
  █  Создает движок хеширования  █
  █                              █
  ▀──────────────────────────────▀*/
module.exports = class HashEngine {
/*┌─────────────┐
  │ Конструктор │
  └─────────────┘*/
    constructor(engine) {
    // Инициализируем движок
        engine(this);
        
    // Инициализируем список логических единиц
        engine.logic(
            'algorithm', // Логика алгоритмов хеширования
        );
    }
    
/*┌───────────────────────────────────────────┐
  │ Формирует буфер главного ключа (32 байта) │
  └───────────────────────────────────────────┘*/
    deriveMasterKeyBuffer = (masterKey) => {
        return this.algorithm.sha256(
            masterKey, // Главный ключ (строка)
        );
    }
    
/*┌─────────────────────────────────────────────────────────┐
  │ Формирует буфер состояния для текущей категории пакетов │
  └─────────────────────────────────────────────────────────┘*/
    deriveStateBuffer = (outputLength, hashBuffer) => {
    // Получаем буфер главного ключа (32 байта)
        const masterKeyBuffer = this.protocol.masterKeyBuffer;
        
    // Возвращаем готовый дайджест
        return this.algorithm.shake256(
               outputLength, // Размер дайджеста
                 hashBuffer, // Буфер хэш-целостности (17 байт)
            masterKeyBuffer, // Буфер главного ключа (32 байта)
        );
    }
    
/*┌───────────────────────────────────────────┐
  │ Формирует буфер хэш-целостности (17 байт) │
  └───────────────────────────────────────────┘*/
    deriveHashBuffer = (...buffers) => {
    // Получаем буфер главного ключа (32 байта)
        const masterKeyBuffer = this.protocol.masterKeyBuffer;
        
    // Формируем готовый дайджест (32 байта)
        const digest = this.algorithm.sha256(
                 ...buffers, // Список буферов
            masterKeyBuffer, // Буфер главного ключа (32 байта)
        );
        
    // Извлекаем буфер хэш-целостности (первые 17 байт)
        const hashBuffer = digest.subarray(0, HASH.SIZE);
        
    // Возвращаем буфер хэш-целостности (17 байт)
        return hashBuffer;
    }
};
