/*▄────────────────────────────▄
  █                            █
  █  Создает движок состояний  █
  █                            █
  ▀────────────────────────────▀*/
module.exports = class StateEngine {
/*┌─────────────┐
  │ Конструктор │
  └─────────────┘*/
    constructor(engine) {
    // Инициализируем движок
        engine(this);
        
    // Инициализируем список логических единиц
        engine.logic(
                 'state', // Логика состояний
             'positions', // Логика списка позиций
            'packetType', // Логика списка типов пакетов
                'origin', // Логика отправителя пакета
                'marker', // Логика проверочного маркера
        );
    }
    
/*┌────────────────────────────────────┐
  │ Инициализирует начальное состояние │
  └────────────────────────────────────┘*/
    initState = () => {
        this.state.initState();
    }
    
/*┌───────────────────────────────────────────────────┐
  │ Обновляет состояние для текущей категории пакетов │
  └───────────────────────────────────────────────────┘*/
    updateState = (category, hashBuffer) => {
        this.state.updateState(category, hashBuffer);
    }
    
/*┌─────────────────────────────────────────────────────────┐
  │ Возвращает список позиций для текущей категории пакетов │
  └─────────────────────────────────────────────────────────┘*/
    getPositions = (category) => {
        return this.positions.getPositions(category);
    }
    
/*┌───────────────────────────────────────┐
  │ Возвращает буфер типа пакета (1 байт) │
  └───────────────────────────────────────┘*/
    getPacketTypeBuffer = (packetType) => {
        return this.packetType.getPacketTypeBuffer(packetType);
    }
    
/*┌────────────────────────────────────────────────┐
  │ Возвращает буфер отправителя пакета (32 байта) │
  └────────────────────────────────────────────────┘*/
    getOriginBuffer = () => {
        return this.origin.getOriginBuffer();
    }
    
/*┌─────────────────────────────────────────────────┐
  │ Возвращает буфер проверочного маркера (16 байт) │
  └─────────────────────────────────────────────────┘*/
    getMarkerBuffer = () => {
        return this.marker.getMarkerBuffer();
    }
};
