/*▄────────────────────▄
  █                    █
  █  Загрузка модулей  █
  █                    █
  ▀────────────────────▀*/
const { Sender } = require('l2raw'); // Работа с RAW-пакетами на уровне L2

/*▄──────────────────────────────────────▄
  █                                      █
  █  Создает роль адаптации передатчика  █
  █                                      █
  ▀──────────────────────────────────────▀*/
module.exports = class SenderL2raw {
/*┌────────────────────┐
  │ Опции по умолчанию │
  └────────────────────┘*/
    defaultOptions = {
    // Передатчик
        sender: {
            iface:     'eth0', // Имя сетевого интерфейса
            delay:        100, // Задержка между пакетами  = 0.1 сек
            delayError: 60000, // Задержка после ошибки    =  60 сек
            timeout:    10000, // Время на отправку пакета =  10 сек
        },
    }
    
/*┌─────────────┐
  │ Конструктор │
  └─────────────┘*/
    constructor(role) {
    // Инициализируем роль
        role(this);
    }
    
/*┌─────────────────────────────────────────────────────────┐
  │ Список адаптеров для приема команд (Protocol → Channel) │
  └─────────────────────────────────────────────────────────┘*/
    commandAdapters = (sender, commands) => ({
    // Обновляет буфер пакета для следующей отправки
        [commands.UPDATE_PACKET]: (packetBuffer) => {
            sender.update(packetBuffer);
        },
    })
    
/*┌─────────────────────────────────────────────────────────────┐
  │ Список адаптеров для передачи сигналов (Channel → Protocol) │
  └─────────────────────────────────────────────────────────────┘*/
    signalAdapters = (sender, {
          START, // Сигнал запуска передатчика
           STOP, // Сигнал остановки передатчика
        RESTART, // Сигнал перезапуска передатчика
          ERROR, // Сигнал ошибок передатчика
           EXIT, // Сигнал аварийного завершения передатчика
        TIMEOUT, // Сигнал таймаута передатчика
    }) => ({
          [START]: (handler) => sender.on('start', handler),
           [STOP]: (handler) => sender.on('stop', handler),
        [RESTART]: (handler) => sender.on('restart', handler),
          [ERROR]: (handler) => sender.on('error', handler),
           [EXIT]: (handler) => sender.on('exit', handler),
        [TIMEOUT]: (handler) => sender.on('timeout', handler),
    })
    
/*┌───────────────────────────┐
  │ Инициализирует передатчик │
  └───────────────────────────┘*/
    initSender = (options) => {
    // Инициализируем передатчик
        const sender = new Sender(options);
        
    // Возвращаем передатчик
        return sender;
    }
};
