/*▄────────────────────▄
  █                    █
  █  Загрузка модулей  █
  █                    █
  ▀────────────────────▀*/
const PACKET = require('../constants/packet-structure'); // Структура полей пакетов

/*┌───────────────────────────────────┐
  │ Извлекаем структуру полей пакетов │
  └───────────────────────────────────┘*/
const {
    PACKETID, // ID-пакета
        HASH, // Хэш-сумма
      NODEID, // ID-ноды
    INITHASH, // Хэш-инициализации
    SYNCHASH, // Хэш-синхронизации
      LENGTH, // Длина фрагмента
    FRAGMENT, // Фрагмент
} = PACKET;

/*▄────────────────────────────────────▄
  █                                    █
  █  Импортирует списки полей пакетов  █
  █                                    █
  ▀────────────────────────────────────▀*/
module.exports = new class packetFields {
/*┌────────────────────────────────────┐
  │ Добавляет структуру в список полей │
  └────────────────────────────────────┘*/
    constructor() {
    // Проходим по всем спискам (SCAN_FIELDS, SEND_FIELDS)
        for (const types of Object.values(this)) {
        // Проходим по каждому типу (INIT, SYNC, DATA, PING)
            for (const type in types) {
            // Создаем список полей пакета [
            //     [field, { OFFSET, SIZE }],
            //     [field, { OFFSET, SIZE }],
            //     [field, { OFFSET, SIZE }],
            //     ...
            // ]
                types[type] = Object.entries(types[type])
                
            // Упрощаем список до [
            //     { field, offset, size },
            //     { field, offset, size },
            //     { field, offset, size },
            //     ...
            // ]
                .map(([field, { OFFSET: offset, SIZE: size }]) => (
                    { field, offset, size }
                ));
            }
        }
    }
    
/*┌─────────────────────────────────┐
  │ Списки полей полученных пакетов │
  └─────────────────────────────────┘*/
    SCAN_FIELDS = {
    // Пакет инициализации
        INIT: {
                HASH, // Хэш-сумма
              NODEID, // ID-ноды
            // INITHASH, // Хэш-инициализации
        },
        
    // Пакет синхронизации
        SYNC: {
                HASH, // Хэш-сумма
            SYNCHASH, // Хэш-синхронизации
        },
        
    // Пакет передачи данных
        DATA: {
                HASH, // Хэш-сумма
              LENGTH, // Длина фрагмента
            FRAGMENT, // Фрагмент
        },
        
    // Пинг-пакет
        PING: {
                HASH, // Хэш-сумма
        },
    }
    
/*┌───────────────────────────────┐
  │ Списки полей пакетов отправки │
  └───────────────────────────────┘*/
    SEND_FIELDS = {
    // Пакет инициализации
        INIT: {
            PACKETID, // ID-пакета
                HASH, // Хэш-сумма
              NODEID, // ID-ноды
            // INITHASH, // Хэш-инициализации
        },
        
    // Пакет синхронизации
        SYNC: {
            PACKETID, // ID-пакета
                HASH, // Хэш-сумма
            SYNCHASH, // Хэш-синхронизации
        },
        
    // Пакет передачи данных
        DATA: {
            PACKETID, // ID-пакета
                HASH, // Хэш-сумма
              LENGTH, // Длина фрагмента
            FRAGMENT, // Фрагмент
        },
        
    // Пинг-пакет
        PING: {
            PACKETID, // ID-пакета
                HASH, // Хэш-сумма
        },
    }
};
