/*┌────────────────────────────────────┐
  │ Импортируем структуру полей пакета │
  └────────────────────────────────────┘*/
const {
    PACKETID, // ID-пакета
        HASH, // Хэш-сумма
      LENGTH, // Длина фрагмента
    FRAGMENT, // Фрагмент
} = require('../constants/packet-structure');

/*▄───────────────────────────────────▄
  █                                   █
  █  Импортирует списки полей пакета  █
  █                                   █
  ▀───────────────────────────────────▀*/
module.exports = new class packetFields {
/*┌─────────────────────────────────┐
  │ Списки полей полученных пакетов │
  └─────────────────────────────────┘*/
    SCAN_FIELDS = {
    // Список полей пакета синхронизации
        SYNC: Object.entries({
            HASH, // Хэш-сумма
        }),
        
    // Список полей пинг-пакета
        PING: Object.entries({
            HASH, // Хэш-сумма
        }),
        
    // Список полей пакета передачи данных
        DATA: Object.entries({
                HASH, // Хэш-сумма
              LENGTH, // Длина фрагмента
            FRAGMENT, // Фрагмент
        }),
    }
    
/*┌───────────────────────────────┐
  │ Списки полей пакетов отправки │
  └───────────────────────────────┘*/
    SEND_FIELDS = {
    // Список полей пакета синхронизации
        SYNC: Object.entries({
            PACKETID, // ID-пакета
                HASH, // Хэш-сумма
        }),
        
    // Список полей пинг-пакета
        PING: Object.entries({
            PACKETID, // ID-пакета
                HASH, // Хэш-сумма
        }),
        
    // Список полей пакета передачи данных
        DATA: Object.entries({
            PACKETID, // ID-пакета
                HASH, // Хэш-сумма
              LENGTH, // Длина фрагмента
            FRAGMENT, // Фрагмент
        }),
    }
};
