/*┌────────────────────────────────────┐
  │ Импортируем структуру полей пакета │
  └────────────────────────────────────┘*/
const {
    PACKETID, // ID-пакета
        HASH, // Хэш-сумма
      LENGTH, // Длина фрагмента
    FRAGMENT, // Фрагмент
} = require('../constants/packet-structure');

/*▄───────────────────────────────────▄
  █                                   █
  █  Импортирует списки полей пакета  █
  █                                   █
  ▀───────────────────────────────────▀*/
module.exports = new class packetFields {
/*┌───────────────────────────────┐
  │ Список полей исходного пакета │
  └───────────────────────────────┘*/
    BASE_FIELDS = Object.entries({
            HASH, // Хэш-сумма
          LENGTH, // Длина фрагмента
        FRAGMENT, // Фрагмент
    })
    
/*┌────────────────────────────────────────────┐
  │ Список полей пакета для следующей отправки │
  └────────────────────────────────────────────┘*/
    SEND_FIELDS = Object.entries({
        PACKETID, // ID-пакета
            HASH, // Хэш-сумма
          LENGTH, // Длина фрагмента
        FRAGMENT, // Фрагмент
    })
};
