/*▄───────────────────────────▄
  █                           █
  █  Создает контракт ошибок  █
  █                           █
  ▀───────────────────────────▀*/
module.exports = class ErrorsContract {
/*┌─────────────┐
  │ Конструктор │
  └─────────────┘*/
    constructor(contract) {
    // Инициализируем контракт
        contract(this);
    }
    
/*┌───────────────┐
  │ Список ошибок │
  └───────────────┘*/
       LANG_NOT_FOUND = 'LANG_NOT_FOUND'    // Выбранный язык не найден
    CHANNEL_NOT_FOUND = 'CHANNEL_NOT_FOUND' // Канал связи не найден
};
