/*▄────────────────────────────▄
  █                            █
  █  Создает контракт методов  █
  █                            █
  ▀────────────────────────────▀*/
module.exports = class MethodsContract {
/*┌─────────────┐
  │ Конструктор │
  └─────────────┘*/
    constructor(contract) {
    // Инициализируем контракт
        contract(this);
    }
    
/*┌──────────────────┐
  │ Методы приемника │
  └──────────────────┘*/
    scanner = {
    }
    
/*┌────────────────────┐
  │ Методы передатчика │
  └────────────────────┘*/
    sender = {
        UPDATE_PACKET: 'updatePacketBuffer' // Обновляет буфер пакета для следующей отправки
    }
};
