/*▄────────────────────▄
  █                    █
  █  Загрузка модулей  █
  █                    █
  ▀────────────────────▀*/
const PACKET = require('../../../constants/packet-structure'); // Структура полей пакетов

/*┌───────────────────────────────────┐
  │ Извлекаем структуру полей пакетов │
  └───────────────────────────────────┘*/
const {
// Категория пакетов синхронизации
    MARKER, // Проверочный маркер
} = PACKET;

/*▄───────────────────────────────────────▄
  █                                       █
  █  Создает логику проверочного маркера  █
  █                                       █
  ▀───────────────────────────────────────▀*/
module.exports = class MarkerState {
/*┌─────────────┐
  │ Конструктор │
  └─────────────┘*/
    constructor(logic) {
    // Инициализируем логическую единицу
        logic(this);
        
    // Инициализируем буфер проверочного маркера
        this.initMarkerBuffer();
    }
    
/*┌───────────────────────────────────────────┐
  │ Инициализирует буфер проверочного маркера │
  └───────────────────────────────────────────┘*/
    initMarkerBuffer = () => {
        this.markerBuffer = Buffer.alloc(MARKER.SIZE);
    }
    
/*┌──────────────────────────────────────┐
  │ Обновляет буфер проверочного маркера │
  └──────────────────────────────────────┘*/
    updateMarkerBuffer = (markerBuffer) => {
        this.markerBuffer.set(markerBuffer);
    }
    
/*┌─────────────────────────────────────────────────┐
  │ Возвращает буфер проверочного маркера (16 байт) │
  └─────────────────────────────────────────────────┘*/
    getMarkerBuffer = () => {
        return this.markerBuffer;
    }
};
