/*▄────────────────────▄
  █                    █
  █  Загрузка модулей  █
  █                    █
  ▀────────────────────▀*/
const crypto = require('crypto');
const PACKET = require('../../../constants/packet-structure'); // Структура полей пакетов

/*┌───────────────────────────────────┐
  │ Извлекаем структуру полей пакетов │
  └───────────────────────────────────┘*/
const {
// Категория пакетов авторизации
    ORIGIN, // Отправитель пакета
} = PACKET;

/*▄─────────────────────────────────────▄
  █                                     █
  █  Создает логику отправителя пакета  █
  █                                     █
  ▀─────────────────────────────────────▀*/
module.exports = class OriginState {
/*┌─────────────┐
  │ Конструктор │
  └─────────────┘*/
    constructor(logic) {
    // Инициализируем логическую единицу
        logic(this);
    }
    
/*┌────────────────────────────────────┐
  │ Обновляет буфер отправителя пакета │
  └────────────────────────────────────┘*/
    updateOriginBuffer = () => {
        this.originBuffer = crypto.randomBytes(ORIGIN.SIZE);
    }
    
/*┌────────────────────────────────────────────────┐
  │ Возвращает буфер отправителя пакета (32 байта) │
  └────────────────────────────────────────────────┘*/
    getOriginBuffer = () => {
        return this.originBuffer;
    }
};
