/*▄────────────────────▄
  █                    █
  █  Загрузка модулей  █
  █                    █
  ▀────────────────────▀*/
const PACKET = require('../../../constants/packet-structure'); // Структура полей пакетов

/*┌─────────────────────────────┐
  │ Импортируем список констант │
  └─────────────────────────────┘*/
const {
    STATE_DEVIATIONS, // Список отклонений от буфера текущего состояния
} = require('../../../constants/constants');

/*┌──────────────────────────────────────┐
  │ Импортируем список категорий пакетов │
  └──────────────────────────────────────┘*/
const {
    CATEGORY, // Список категорий пакетов
} = require('../../../constants/packet-categories');

/*┌───────────────────────────────────┐
  │ Извлекаем структуру полей пакетов │
  └───────────────────────────────────┘*/
const {
// Все категории пакетов
    TYPE, // Тип пакета
} = PACKET;

/*▄───────────────────────────────────────▄
  █                                       █
  █  Создает логику списка типов пакетов  █
  █                                       █
  ▀───────────────────────────────────────▀*/
module.exports = class PacketTypeState {
/*┌─────────────┐
  │ Конструктор │
  └─────────────┘*/
    constructor(logic) {
    // Инициализируем логическую единицу
        logic(this);
        
    // Инициализируем список буферов типов пакетов
        this.initPacketTypeBuffers();
    }
    
/*┌─────────────────────────────────────────────┐
  │ Инициализирует список буферов типов пакетов │
  └─────────────────────────────────────────────┘*/
    initPacketTypeBuffers = () => {
    // Инициализируем список буферов типов пакетов
        this.packetTypeBuffers = {};
        
    // Проходим по списку категорий пакетов
        for (const category in CATEGORY) {
        // Получаем список всех типов для текущей категории пакетов
            const packetTypes = CATEGORY[category];
            
        // Проходим по списку всех типов для текущей категории пакетов
            for (let packetType of packetTypes) {
            // Инициализируем буфер типа пакета
                this.packetTypeBuffers[packetType] = Buffer.alloc(TYPE.SIZE);
            }
        }
    }
    
/*┌──────────────────────────────────────────────────────────────────────┐
  │ Обновляет список буферов типов пакетов для текущей категории пакетов │
  └──────────────────────────────────────────────────────────────────────┘*/
    updatePacketTypeBuffers = (category, packetTypeBuffer) => {
    // Получаем список всех типов для текущей категории пакетов
        const packetTypes = CATEGORY[category];
        
    // Обновляем список буферов типов пакетов для текущей категории пакетов
        for (let packetType of packetTypes) {
        // Обновляем буфер типа пакета
            this.packetTypeBuffers[packetType].set(packetTypeBuffer);
            
        // Добавляем отклонение от буфера текущего состояния
            this.packetTypeBuffers[packetType][0] += STATE_DEVIATIONS[packetType];
        }
    }
    
/*┌───────────────────────────────────────┐
  │ Возвращает буфер типа пакета (1 байт) │
  └───────────────────────────────────────┘*/
    getPacketTypeBuffer = (packetType) => {
        return this.packetTypeBuffers[packetType];
    }
};
