/*▄────────────────────▄
  █                    █
  █  Загрузка модулей  █
  █                    █
  ▀────────────────────▀*/
const error = require('../../error'); // Обработчик ошибки при регистрации

/*▄─────────────────────────────────────────▄
  █                                         █
  █  Создает правило инициализации движков  █
  █                                         █
  ▀─────────────────────────────────────────▀*/
module.exports = new class Engines {
/*┌──────────────────────────┐
  │ Определяет путь к движку │
  └──────────────────────────┘*/
    path = ([ scope ], [ engine ]) => [
                      '..', // Директория протокола
                     scope, // Имя директории движков
                    engine, // Имя директории движка
        `${engine}-engine`, // Имя файла движка
    ]
    
/*┌──────────────────────────────────┐
  │ Опции инициализации по умолчанию │
  └──────────────────────────────────┘*/
    defaultOptions = { INIT_PROTOCOL: true }
    
/*┌───────────────────────┐
  │ Инициализирует движок │
  └───────────────────────┘*/
    init = (protocol, engine, options) => {
    // Сохраняем ссылку на основной протокол
        if (options.INIT_PROTOCOL) {
            engine.protocol = protocol;
        }
    }
    
/*┌─────────────────────────────────┐
  │ Регистрирует движок в протоколе │
  └─────────────────────────────────┘*/
    register = (protocol, engine, [ scopeName ], [ engineName ]) => {
    // Проверяем имя движка в протоколе
        if (engineName in protocol) {
            error('ENGINE_ALREADY_EXISTS', [
                `Движок '${engineName}' уже существует!`,
                `Ошибка в протоколе!`,
                `Класс: ${protocol.constructor.name}`,
            ]);
        }
        
    // Регистрируем движок в протоколе
        protocol[engineName] = engine;
    }
};
