/*▄────────────────────────────────────────────────────▄
  █                                                    █
  █  Создает логику получения списка портов приемника  █
  █                                                    █
  ▀────────────────────────────────────────────────────▀*/
module.exports = class ScannerPort {
/*┌─────────────┐
  │ Конструктор │
  └─────────────┘*/
    constructor(logic) {
    // Инициализируем логическую единицу
        logic(this);
    }
    
/*┌───────────────────────────────────────────────────────────────────┐
  │ Возвращает список портов для приема сигналов (Channel → Protocol) │
  └───────────────────────────────────────────────────────────────────┘*/
    signals = (contract) => {
        return this.engine.ports.scanner.signals(this.protocol, contract);
    }
};
