/*▄──────────────────────────────────────────────────────▄
  █                                                      █
  █  Создает логику получения списка портов передатчика  █
  █                                                      █
  ▀──────────────────────────────────────────────────────▀*/
module.exports = class SenderPort {
/*┌─────────────┐
  │ Конструктор │
  └─────────────┘*/
    constructor(logic) {
    // Инициализируем логическую единицу
        logic(this);
    }
    
/*┌───────────────────────────────────────────────────────────────────┐
  │ Возвращает список портов для приема сигналов (Channel → Protocol) │
  └───────────────────────────────────────────────────────────────────┘*/
    signals = (contract) => {
        return this.engine.ports.sender.signals(this.protocol, contract);
    }
};
