/*▄───────────────────────────────────▄
  █                                   █
  █  Создает логику отправки пакетов  █
  █                                   █
  ▀───────────────────────────────────▀*/
module.exports = class SenderIo {
/*┌─────────────┐
  │ Конструктор │
  └─────────────┘*/
    constructor(logic) {
    // Инициализируем логическую единицу
        logic(this);
    }
    
/*┌───────────────────────────────────────────────┐
  │ Обновляет буфер пакета для следующей отправки │
  └───────────────────────────────────────────────┘*/
    updatePacketBuffer = (packetBuffer) => {
        this.protocol.command.updatePacketBuffer(packetBuffer);
    }
};
