/*▄─────────────────────────────────▄
  █                                 █
  █  Создает инициализатор движков  █
  █                                 █
  ▀─────────────────────────────────▀*/
module.exports = class Engines {
/*┌──────────────────────────┐
  │ Определяет путь к движку │
  └──────────────────────────┘*/
    path = (engineName) => ['engines', engineName, `${engineName}-engine`]
    
/*┌───────────────────────┐
  │ Инициализирует движок │
  └───────────────────────┘*/
    init = (protocol, engine) => {
    // Сохраняем ссылку на основной протокол
        engine.protocol = protocol;
    }
    
/*┌─────────────────────────────────┐
  │ Регистрирует движок в протоколе │
  └─────────────────────────────────┘*/
    register = (protocol, engine, engineName) => {
    // Проверяем имя движка в протоколе
        if (engineName in protocol) {
            throw new Error(
                `Имя движка "${engineName}" уже существует в протоколе!`
            );
        }
        
    // Регистрируем движок в протоколе
        protocol[engineName] = engine;
    }
};
