/*▄──────────────────────────────▄
  █                              █
  █  Создает роли каналов связи  █
  █                              █
  ▀──────────────────────────────▀*/
module.exports = class ChannelsRoles {
/*┌─────────────┐
  │ Конструктор │
  └─────────────┘*/
    constructor(roles) {
    // Инициализируем роли
        roles(this);
    }
    
/*┌──────────────────────┐
  │ Список каналов связи │
  └──────────────────────┘*/
    scanner = 'scanner' // Роль адаптации приемника
     sender =  'sender' // Роль адаптации передатчика
};
