/*▄────────────────────────────▄
  █                            █
  █  Создает роли уведомлений  █
  █                            █
  ▀────────────────────────────▀*/
module.exports = class NoticesRoles {
/*┌─────────────┐
  │ Конструктор │
  └─────────────┘*/
    constructor(roles) {
    // Инициализируем роли без сохранения ссылки на основной протокол
        roles(this, { INIT_PROTOCOL: false });
    }
    
/*┌─────────────────────────────────┐
  │ Список информационных сообщений │
  └─────────────────────────────────┘*/
    info = {
    }
    
/*┌───────────────────────┐
  │ Список предупреждений │
  └───────────────────────┘*/
    warn = {
        LANG_NOT_FOUND: 'LANG_NOT_FOUND', // Выбранный язык не найден
    }
    
/*┌───────────────┐
  │ Список ошибок │
  └───────────────┘*/
    error = {
           INTERNAL_ERROR:    'INTERNAL_ERROR', // Внутренняя ошибка
        CHANNEL_NOT_FOUND: 'CHANNEL_NOT_FOUND', // Канал связи не найден
    }
};
