/*▄──────────────────────────────▄
  █                              █
  █  Создает движок уведомлений  █
  █                              █
  ▀──────────────────────────────▀*/
module.exports = class NoticeEngine {
/*┌─────────────┐
  │ Конструктор │
  └─────────────┘*/
    constructor(engine) {
    // Инициализируем движок
        engine(this);
        
    // Инициализируем список логических единиц
        engine.logic(
             'formatter', // Логика форматирования уведомлений
             'localizer', // Логика локализации уведомлений
               'builder', // Логика создания уведомлений
            'dispatcher', // Логика отправки уведомлений
        );
    }
    
/*┌─────────────────────────────────────┐
  │ Отправляет информационное сообщение │
  └─────────────────────────────────────┘*/
    reportInfo = (contract, ...args) => {
        this.dispatcher.reportInfo(contract, ...args);
    }
    
/*┌───────────────────────────┐
  │ Отправляет предупреждение │
  └───────────────────────────┘*/
    reportWarn = (contract, ...args) => {
        this.dispatcher.reportWarn(contract, ...args);
    }
    
/*┌────────────────────────────────┐
  │ Отправляет сообщение об ошибке │
  └────────────────────────────────┘*/
    reportError = (contract, ...args) => {
        this.dispatcher.reportError(contract, ...args);
    }
    
/*┌───────────────────────────────────────────────────────┐
  │ Отправляет сообщение об ошибке во время инициализации │
  └───────────────────────────────────────────────────────┘*/
    initError = (contract, ...args) => {
        this.dispatcher.initError(contract, ...args);
    }
};
