/*▄─────────────────────────────▄
  █                             █
  █  Создает движок шифрования  █
  █                             █
  ▀─────────────────────────────▀*/
module.exports = class CryptoEngine {
/*┌─────────────┐
  │ Конструктор │
  └─────────────┘*/
    constructor(engine) {
    // Инициализируем движок
        engine(this);
        
    // Инициализируем список логических единиц
        engine.logic(
            'encryptor', // Логика шифрования
            'decryptor', // Логика дешифрования
        );
    }
    
/*┌────────────────────────────────────────────────────┐
  │ Возвращает зашифрованный буфер исходного сообщения │
  └────────────────────────────────────────────────────┘*/
    encrypt = (messageBuffer) => {
        return this.encryptor.encrypt(messageBuffer);
    }
    
/*┌─────────────────────────────────────────────────────┐
  │ Возвращает расшифрованный буфер исходного сообщения │
  └─────────────────────────────────────────────────────┘*/
    decrypt = (encryptedBuffer) => {
        return this.decryptor.decrypt(encryptedBuffer);
    }
};
