/*▄────────────────────────────────────▄
  █                                    █
  █  Создает движок обработки пакетов  █
  █                                    █
  ▀────────────────────────────────────▀*/
module.exports = class PacketEngine {
/*┌─────────────┐
  │ Конструктор │
  └─────────────┘*/
    constructor(engine) {
    // Инициализируем движок
        engine(this);
        
    // Инициализируем список логических единиц
        engine.logic(
            'builder', // Логика сборки пакетов отправки
            'encoder', // Логика кодирования пакетов
            'decoder', // Логика декодирования пакетов
        );
    }
    
/*┌───────────────────────────────────────────────────────────────────┐
  │ Создает исходный пакет отправки для категории пакетов авторизации │
  └───────────────────────────────────────────────────────────────────┘*/
    createAuthPacket = (packetType, target) => {
        return this.builder.createAuthPacket(packetType, target);
    }
    
/*┌─────────────────────────────────────────────────────────────────────┐
  │ Создает исходный пакет отправки для категории пакетов синхронизации │
  └─────────────────────────────────────────────────────────────────────┘*/
    createSyncPacket = () => {
        return this.builder.createSyncPacket();
    }
    
/*┌──────────────────────────────────────────────┐
  │ Декодирует полученный буфер в исходный пакет │
  └──────────────────────────────────────────────┘*/
    decodePacket = (category, packetBuffer) => {
        return this.decoder.decodePacket(category, packetBuffer);
    }
};
