/*▄─────────────────────────▄
  █                         █
  █  Создает движок языков  █
  █                         █
  ▀─────────────────────────▀*/
module.exports = class LangEngine {
/*┌─────────────┐
  │ Конструктор │
  └─────────────┘*/
    constructor(engine) {
    // Инициализируем движок
        engine(this);
        
    // Инициализируем список логических единиц
        engine.logic(
             'director', // Логика инициализации выбранного языка
            'activator', // Логика активации выбранного языка
              'factory', // Логика инициализации списка локализаторов
        );
    }
    
/*┌───────────────────────────────┐
  │ Инициализирует выбранный язык │
  └───────────────────────────────┘*/
    initLang = () => {
        return this.director.initLang();
    }
    
/*┌──────────────────────────────────┐
  │ Возвращает локализатор контракта │
  └──────────────────────────────────┘*/
    getLocalizer = (roles, role, contract) => {
        return this.factory.getLocalizer(roles, role, contract);
    }
};
