/*▄────────────────────▄
  █                    █
  █  Загрузка модулей  █
  █                    █
  ▀────────────────────▀*/
const crypto = require('crypto');
const Engine = require('../engine'); // Базовый класс для всех движков
const PACKET = require('../constants/packet-structure'); // Структура полей пакетов

/*┌─────────────────────────────┐
  │ Импортируем список констант │
  └─────────────────────────────┘*/
const {
    SALT, // Список буферов для обеспечения уникальности каждого дайджеста
} = require('../constants/constants');

/*┌───────────────────────────────────┐
  │ Извлекаем структуру полей пакетов │
  └───────────────────────────────────┘*/
const {
    PACKETID, // ID-пакета
        HASH, // Хэш-сумма
} = PACKET;

/*▄──────────────────────────────▄
  █                              █
  █  Создает движок хеширования  █
  █                              █
  ▀──────────────────────────────▀*/
module.exports = class HashEngine extends Engine {
/*┌─────────────┐
  │ Конструктор │
  └─────────────┘*/
    constructor(protocol) {
    // Сохраняем буфер главного ключа и ссылку на основной протокол
        super(protocol);
    }
    
/*┌────────────────────────────────────────────────┐
  │ Возвращает готовый дайджест (алгоритм SHA-256) │
  └────────────────────────────────────────────────┘*/
    static sha256(...buffers) {
    // Создаем новый дайджест
        const digest = crypto.createHash('sha256');
        
    // Обновляем состояние дайджеста для каждого буфера
        for (const buffer of buffers) digest.update(buffer);
        
    // Возвращаем готовый дайджест (32 байта)
        return digest.digest();
    }
    
/*┌──────────────────────────────────────────────────┐
  │ Возвращает готовый дайджест (алгоритм SHAKE-256) │
  └──────────────────────────────────────────────────┘*/
    static shake256(outputLength, ...buffers) {
    // Создаем новый дайджест
        const digest = crypto.createHash('shake256', { outputLength });
        
    // Обновляем состояние дайджеста для каждого буфера
        for (const buffer of buffers) digest.update(buffer);
        
    // Возвращаем готовый дайджест (от 1 байта)
        return digest.digest();
    }
    
/*┌────────────────────────────────────────────┐
  │ Возвращает буфер главного ключа (32 байта) │
  └────────────────────────────────────────────┘*/
    static getMasterKeyBuffer(masterKey) {
        return HashEngine.sha256(
            masterKey, // Главный ключ (строка)
        );
    }
    
/*┌────────────────────────────────────────────────┐
  │ Возвращает буфер одноразового ключа (32 байта) │
  └────────────────────────────────────────────────┘*/
    getKeyBuffer = (hashBuffer) => {
    // Получаем буфер главного ключа (32 байта)
        const masterKeyBuffer = this.masterKeyBuffer;
        
    // Возвращаем готовый дайджест (32 байта)
        return HashEngine.sha256(
            masterKeyBuffer, // Буфер главного ключа (32 байта)
                 hashBuffer, // Буфер предыдущей хэш-суммы (17 байт)
        );
    }
    
/*┌───────────────────────────────────────────────┐
  │ Возвращает буфер базового ID-пакета (17 байт) │
  └───────────────────────────────────────────────┘*/
    getBasePacketIdBuffer = (keyBuffer) => {
        return HashEngine.shake256(
            PACKETID.SIZE, // Размер базового ID-пакета (17 байт)
                keyBuffer, // Буфер одноразового ключа (32 байта)
            SALT.PACKETID, // Дополнительный статический буфер (1 байт)
        );
    }
    
/*┌─────────────────────────────────────────────────────────────────────┐
  │ Возвращает буфер дайджеста для списка следующих позиций (3016 байт) │
  └─────────────────────────────────────────────────────────────────────┘*/
    getPositionsBuffer = (keyBuffer) => {
    // Определяем размер дайджеста по два байта на каждую позицию (1508 * 2 = 3016 байт)
        const outputLength = PACKET.SIZE * 2;
        
    // Возвращаем готовый дайджест (3016 байт)
        return HashEngine.shake256(
              outputLength, // Размер дайджеста для списка позиций (3016 байт)
                 keyBuffer, // Буфер одноразового ключа (32 байта)
            SALT.POSITIONS, // Дополнительный статический буфер (1 байт)
        );
    }
    
/*┌──────────────────────────────────────┐
  │ Возвращает буфер хэш-суммы (17 байт) │
  └──────────────────────────────────────┘*/
    getHashBuffer = (lengthBuffer, fragmentBuffer) => {
    // Получаем буфер главного ключа (32 байта)
        const masterKeyBuffer = this.masterKeyBuffer;
        
    // Возвращаем готовый дайджест (17 байт)
        return HashEngine.shake256(
                  HASH.SIZE, // Размер хэш-суммы (17 байт)
            masterKeyBuffer, // Буфер главного ключа (32 байта)
               lengthBuffer, // Буфер длины фрагмента (2 байта)
             fragmentBuffer, // Буфер фрагмента (до 1472 байт)
        );
    }
};
