/*▄──────────────────────────▄
  █                          █
  █  Создает движок событий  █
  █                          █
  ▀──────────────────────────▀*/
module.exports = class EventEngine {
/*┌─────────────┐
  │ Конструктор │
  └─────────────┘*/
    constructor(engine) {
    // Инициализируем движок
        engine(this);
        
    // Инициализируем список логических единиц
        engine.logic(
               'core', // Логика событий протокола
            'scanner', // Логика событий приемника
             'sender', // Логика событий передатчика
        );
    }
    
/*┌──────────────────────────────────┐
  │ Сообщает о готовности соединения │
  └──────────────────────────────────┘*/
    ready = () => {
        this.core.ready();
    }
    
/*┌─────────────────────────────┐
  │ Сообщает о получении пакета │
  └─────────────────────────────┘*/
    data = (packet, packetBuffer) => {
        this.core.data(packet, packetBuffer);
    }
    
/*┌───────────────────────────────────────┐
  │ Сообщает о получении нового сообщения │
  └───────────────────────────────────────┘*/
    message = (message) => {
        this.core.message(message);
    }
    
/*┌───────────────────────────────┐
  │ Сообщает о доставке сообщения │
  └───────────────────────────────┘*/
    delivered = (message) => {
        this.core.delivered(message);
    }
};
