/*▄──────────────────────────▄
  █                          █
  █  Создает движок событий  █
  █                          █
  ▀──────────────────────────▀*/
module.exports = class EventEngine {
/*┌─────────────┐
  │ Конструктор │
  └─────────────┘*/
    constructor(engine) {
    // Инициализируем движок
        engine(this);
        
    // Инициализируем список логических единиц
        engine.logic(
                'readyEvent', // Логика события готовности соединения
                 'dataEvent', // Логика события получения пакета
              'messageEvent', // Логика события получения нового сообщения
            'deliveredEvent', // Логика события доставки сообщения
        );
    }
    
/*┌──────────────────────────────────┐
  │ Сообщает о готовности соединения │
  └──────────────────────────────────┘*/
    ready = () => {
        this.readyEvent.emit();
    }
    
/*┌─────────────────────────────┐
  │ Сообщает о получении пакета │
  └─────────────────────────────┘*/
    data = (packet, packetBuffer) => {
        this.dataEvent.emit(packet, packetBuffer);
    }
    
/*┌───────────────────────────────────────┐
  │ Сообщает о получении нового сообщения │
  └───────────────────────────────────────┘*/
    message = (message) => {
        this.messageEvent.emit(message);
    }
    
/*┌───────────────────────────────┐
  │ Сообщает о доставке сообщения │
  └───────────────────────────────┘*/
    delivered = (message) => {
        this.deliveredEvent.emit(message);
    }
};
