/*▄────────────────────▄
  █                    █
  █  Загрузка модулей  █
  █                    █
  ▀────────────────────▀*/
const EventEmitter = require('events');

/*▄──────────────────────────▄
  █                          █
  █  Создает движок событий  █
  █                          █
  ▀──────────────────────────▀*/
module.exports = class EventEngine extends EventEmitter {
/*┌─────────────┐
  │ Конструктор │
  └─────────────┘*/
    constructor(engine) {
    // Вызываем конструктор родителя
        super();
        
    // Инициализируем движок
        engine(this);
        
    // Инициализируем список логических единиц
        engine.logic(
            'factory', // Логика инициализации событий
        );
        
    // Инициализируем список интерфейсов
        engine.interfaces(
            'iProtocol', // Интерфейс протокола
             'iScanner', // Интерфейс приемника
              'iSender', // Интерфейс передатчика
        );
    }
    
/*┌───────────────────────────────┐
  │ Инициализирует список событий │
  └───────────────────────────────┘*/
    initEvents = () => {
        this.factory.initEvents();
    }
    
/*┌──────────────────────────────────┐
  │ Сообщает о готовности соединения │
  └──────────────────────────────────┘*/
    ready = () => {
        this.interfaces.iProtocol.ready();
    }
    
/*┌─────────────────────────────┐
  │ Сообщает о получении пакета │
  └─────────────────────────────┘*/
    data = (packet, packetBuffer) => {
        this.interfaces.iProtocol.data(packet, packetBuffer);
    }
    
/*┌───────────────────────────────────────┐
  │ Сообщает о получении нового сообщения │
  └───────────────────────────────────────┘*/
    message = (message) => {
        this.interfaces.iProtocol.message(message);
    }
    
/*┌───────────────────────────────┐
  │ Сообщает о доставке сообщения │
  └───────────────────────────────┘*/
    delivered = (message) => {
        this.interfaces.iProtocol.delivered(message);
    }
};
