/*▄─────────────────────────────────────▄
  █                                     █
  █  Создает локализацию списка ошибок  █
  █                                     █
  ▀─────────────────────────────────────▀*/
module.exports = class ErrorsRu {
/*┌─────────────┐
  │ Конструктор │
  └─────────────┘*/
    constructor(localization) {
    // Инициализируем локализацию
        localization(this);
    }
    
/*┌─────────────────────────────────┐
  │ Возвращает список локализаторов │
  └─────────────────────────────────┘*/
    getLocalizers = (contract) => ({
           [contract.LANG_NOT_FOUND]: (name) => `Выбранный язык "${name}" не найден!`,
        [contract.CHANNEL_NOT_FOUND]: (name) => `Канал связи "${name}" не найден!`,
    })
};
