/*▄────────────────────▄
  █                    █
  █  Загрузка модулей  █
  █                    █
  ▀────────────────────▀*/
const crypto = require('crypto');

/*▄─────────────────────────────────────────▄
  █                                         █
  █  Создает логику алгоритмов хеширования  █
  █                                         █
  ▀─────────────────────────────────────────▀*/
module.exports = class AlgorithmHash {
/*┌─────────────┐
  │ Конструктор │
  └─────────────┘*/
    constructor(logic) {
    // Инициализируем логическую единицу
        logic(this);
    }
    
/*┌───────────────────────────────────────────────┐
  │ Формирует готовый дайджест (алгоритм SHA-256) │
  └───────────────────────────────────────────────┘*/
    sha256 = (...buffers) => {
    // Создаем новый дайджест
        const digest = crypto.createHash('sha256');
        
    // Обновляем состояние дайджеста для каждого буфера
        for (const buffer of buffers) digest.update(buffer);
        
    // Возвращаем готовый дайджест (32 байта)
        return digest.digest();
    }
    
/*┌─────────────────────────────────────────────────┐
  │ Формирует готовый дайджест (алгоритм SHAKE-256) │
  └─────────────────────────────────────────────────┘*/
    shake256 = (outputLength, ...buffers) => {
    // Создаем новый дайджест
        const digest = crypto.createHash('shake256', { outputLength });
        
    // Обновляем состояние дайджеста для каждого буфера
        for (const buffer of buffers) digest.update(buffer);
        
    // Возвращаем готовый дайджест (от 1 байта)
        return digest.digest();
    }
};
