/*▄────────────────────▄
  █                    █
  █  Загрузка модулей  █
  █                    █
  ▀────────────────────▀*/
const util = require('util');

/*▄─────────────────────────────────────────────▄
  █                                             █
  █  Создает логику форматирования уведомлений  █
  █                                             █
  ▀─────────────────────────────────────────────▀*/
module.exports = class FormatterNotice {
/*┌─────────────┐
  │ Конструктор │
  └─────────────┘*/
    constructor(logic) {
    // Инициализируем логическую единицу
        logic(this);
    }
    
/*┌──────────────────────────────────────────────────┐
  │ Возвращает диагностическое представление объекта │
  └──────────────────────────────────────────────────┘*/
    formatDiagnostic = (value) => {
        return util.inspect(value, { depth: 1, maxArrayLength: 10 });
    }
    
/*┌─────────────────────────────────────────────────────────────┐
  │ Возвращает уведомление "Контракт не найден" без локализации │
  └─────────────────────────────────────────────────────────────┘*/
    formatFallbackContractNotFound = (contract, args) => {
    // Инициализируем контракт "Контракт не найден"
        const CONTRACT_NOT_FOUND = 'CONTRACT_NOT_FOUND';
        
    // Инициализируем уведомление "Контракт не найден" без локализации
        const notice = [
        // Исходный контракт
            `CONTRACT: ${this.formatDiagnostic(contract)}`,
            
        // Список аргументов
            `ARGS: ${this.formatDiagnostic(args)}`,
        ].join(', ');
        
    // Возвращаем уведомление "Контракт не найден" без локализации
        return [CONTRACT_NOT_FOUND, [notice]];
    }
    
/*┌────────────────────────────────────────┐
  │ Возвращает уведомление без локализации │
  └────────────────────────────────────────┘*/
    formatFallbackNotice = (contract, args) => {
    // Инициализируем уведомление без локализации
        const notice = [
        // Список аргументов
            `ARGS: ${this.formatDiagnostic(args)}`,
        ].join(', ');
        
    // Возвращаем уведомление без локализации
        return [contract, [notice]];
    }
};
