/*▄──────────────────────────────────────────────▄
  █                                              █
  █  Создает список внутренних команд протокола  █
  █                                              █
  ▀──────────────────────────────────────────────▀*/
module.exports = class CoreCommands {
/*┌─────────────┐
  │ Конструктор │
  └─────────────┘*/
    constructor(commands) {
    // Инициализируем список команд
        commands(this);
        
    // Получаем контракт со списком внутренних команд протокола
        this.contract = this.protocol.registry.commands.core;
    }
    
/*┌──────────────────────────────────┐
  │ Сообщает о готовности соединения │
  └──────────────────────────────────┘*/
    ready = () => {
    // Отправляем команду протоколу
        this.protocol.emit(this.contract.READY);
    }
    
/*┌─────────────────────────────┐
  │ Сообщает о получении пакета │
  └─────────────────────────────┘*/
    data = (packet, packetBuffer) => {
    // Отправляем команду протоколу
        this.protocol.emit(this.contract.DATA, packet, packetBuffer);
    }
    
/*┌───────────────────────────────────────┐
  │ Сообщает о получении нового сообщения │
  └───────────────────────────────────────┘*/
    message = (message) => {
    // Отправляем команду протоколу
        this.protocol.emit(this.contract.MESSAGE, message);
    }
    
/*┌───────────────────────────────┐
  │ Сообщает о доставке сообщения │
  └───────────────────────────────┘*/
    delivered = (message) => {
    // Отправляем команду протоколу
        this.protocol.emit(this.contract.DELIVERED, message);
    }
};
