/*▄───────────────────────────────▄
  █                               █
  █  Создает движок ввода-вывода  █
  █                               █
  ▀───────────────────────────────▀*/
module.exports = class IoEngine {
/*┌─────────────┐
  │ Конструктор │
  └─────────────┘*/
    constructor(engine) {
    // Инициализируем движок
        engine(this);
        
    // Инициализируем список логических единиц
        engine.logic(
            'scanner', // Логика получения пакетов
             'sender', // Логика отправки пакетов
        );
    }
    
/*┌──────────────────────────────┐
  │ Обработчик получения пакетов │
  └──────────────────────────────┘*/
    onPacket = (packetBuffer) => {
        this.scanner.onPacket(packetBuffer);
    }
    
/*┌───────────────────────────────────────────────┐
  │ Обновляет буфер пакета для следующей отправки │
  └───────────────────────────────────────────────┘*/
    updatePacketBuffer = (packetBuffer) => {
        this.sender.updatePacketBuffer(packetBuffer);
    }
};
