/*▄────────────────────────────────▄
  █                                █
  █  Создает движок каналов связи  █
  █                                █
  ▀────────────────────────────────▀*/
module.exports = class ChannelEngine {
/*┌─────────────┐
  │ Конструктор │
  └─────────────┘*/
    constructor(engine) {
    // Инициализируем движок
        engine(this);
        
    // Инициализируем список логических единиц
        engine.logic(
             'factory', // Логика инициализации канала связи
            'channels', // Логика каналов связи
        );
        
    // Инициализируем список каналов связи
        this.channels.initChannels(engine, [
            'l2raw', // Канал связи на уровне L2
        ]);
    }
    
/*┌────────────────────────────┐
  │ Инициализирует канал связи │
  └────────────────────────────┘*/
    initChannel = () => {
        this.factory.initChannel();
    }
    
/*┌───────────────────────────────────────────────┐
  │ Обновляет буфер пакета для следующей отправки │
  └───────────────────────────────────────────────┘*/
    updatePacketBuffer = (packetBuffer) => {
        this.channels.updatePacketBuffer(packetBuffer);
    }
};
